# Домашнее задание "Библиотека Pandas"
## Задание 1

Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера.  Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [11]:
movies = pd.read_csv('movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [12]:
ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [14]:
df = ratings.merge(movies, on='movieId', how='inner')
df.head()

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,5,1,4.0,847434962,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,7,1,4.5,1106635946,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
3,15,1,2.5,1510577970,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
4,17,1,4.5,1305696483,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy

In [21]:
df[df.rating == 5].title.value_counts().head(1)

Shawshank Redemption, The (1994)    153
Name: title, dtype: int64

## Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года.  Не учитывайте в расчетах отрицательные значения quantity.

In [22]:
data = pd.read_csv('11_power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [65]:
data[ data['country'].str.contains('lat|lit|est', case=False) ]['country'].unique()

array(['Lithuania', 'Latvia', 'Estonia', 'State of Palestine',
       'Timor-Leste'], dtype=object)

In [66]:
data[(((data.category == 4) | (data.category == 12)| (data.category == 21)) &
      ((data.country == 'Latvia') | (data.country == 'Estonia') | (data.country == 'Lithuania')) &
      (data.year >= 2005) & (data.year <= 2010) &
      (data.quantity >= 0)
     )].quantity.sum()

240580.0

## Задание 3

Выберите страницу любого сайта с табличными данными.  Импортируйте таблицы в pandas dataframe.  
Примеры страниц (необязательно брать именно эти):  
https://fortrader.org/quotes  
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [77]:
data_html1 = pd.read_html('https://fortrader.org/quotes/commodity-markets', encoding='utf-8')
data_html1[0].head()

                           Название    Цена  Изменение Изменение(%)  Обновлено
0  Нефть (BRENT) Курс нефти сегодня  35.230     -0.110        -0.31        NaN
1   Нефть (WTI) Цены на нефть (WTI)  33.430     -0.010        -0.03        NaN
2          Сахар котировки на сахар  12.630     11.680    +1 229.47        NaN
3                   Газ Цена на газ   1.741     -0.001       -0.057        NaN

In [81]:
data_html2 = pd.read_html('https://www.finanz.ru/birzhevyye-tovary', encoding='utf-8')
data_html2[0].head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,ММВБ,2 709,"-0,3%",Nasdaq,9 325,"0,4%",Биткойн,9 301,"1,4%",USD/RUB,715745,"0,9%"
1,РТС,1 188,"-1,5%",S&P500,2 955,"0,2%",Нефть,351,"-2,3%",EUR/RUB,780390,"0,3%"
2,Dow,24 465,"0,0%",FTSE100,5 993,"-0,4%",Золото,1 737,"0,0%",EUR/USD,10898,"-0,5%"